app/controllers/rss_urls_controller.rb

SELECT "rss_urls".* FROM "rss_urls"
---
  def index
    @rss_urls = RssUrl.all

INSERT INTO "rss_urls" ("url", "created_at", "updated_at") VALUES (?, ?, ?)  [["url", "http://timesofindia.indiatimes.com/rssfeedstopstories.cms"], ["created_at", "2016-08-03 14:29:09.033158"], ["updated_at", "2016-08-03 14:29:09.033158"]]
---
  def create
    @rss_url = RssUrl.new(rss_url_params)

    respond_to do |format|
      if @rss_url.save

SELECT  "rss_urls".* FROM "rss_urls" WHERE "rss_urls"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_rss_url
      @rss_url = RssUrl.find(params[:id])